Tekla Open API Reference for Tekla Structures 2025
Phase.Insert Method
 Creates a new phase.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Insert()
Public Function Insert As Boolean
Return Value
Type: Boolean
True on success, false if failed (the reason for the failure is probably that the phase number already exists).
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace